In [1]:
import pandas as pd

In [2]:
people = {
    'name' : ['Azamat', 'Zhuldyz', 'Azamat', 'Kamila'],
    'surname' : ['Tolegazinov', 'Gabitova', 'Bolatov', 'Hamitova'],
    'email' : ['aza.tol@gamil.com', 'zhuldyz99@gmail.com', 'azamat.g@mail.ru', 'kami.hamitova@yandex.ru']
}

In [3]:
data = pd.DataFrame(people)

In [4]:
data

      name      surname                    email
0   Azamat  Tolegazinov        aza.tol@gamil.com
1  Zhuldyz     Gabitova      zhuldyz99@gmail.com
2   Azamat      Bolatov         azamat.g@mail.ru
3   Kamila     Hamitova  kami.hamitova@yandex.ru

In [5]:
filt = data['name'] == 'Azamat'

In [6]:
data[filt]

     name      surname              email
0  Azamat  Tolegazinov  aza.tol@gamil.com
2  Azamat      Bolatov   azamat.g@mail.ru

In [7]:
data.loc[filt, 'email']

0    aza.tol@gamil.com
2     azamat.g@mail.ru
Name: email, dtype: object

In [8]:
data

      name      surname                    email
0   Azamat  Tolegazinov        aza.tol@gamil.com
1  Zhuldyz     Gabitova      zhuldyz99@gmail.com
2   Azamat      Bolatov         azamat.g@mail.ru
3   Kamila     Hamitova  kami.hamitova@yandex.ru

In [9]:
filt1 = (data['name'] == 'Azamat') | (data['surname'] == 'Hamitova')

In [10]:
data[filt1]

     name      surname                    email
0  Azamat  Tolegazinov        aza.tol@gamil.com
2  Azamat      Bolatov         azamat.g@mail.ru
3  Kamila     Hamitova  kami.hamitova@yandex.ru

In [11]:
df_public = pd.read_csv('survey_results_public.csv')
df_schema = pd.read_csv('survey_results_schema.csv')

In [12]:
high_salary = df_public['ConvertedComp'] > 70000

In [14]:
df_public.loc[high_salary, ['Country', 'LanguageWorkedWith', 'ConvertedComp']]

,Country,LanguageWorkedWith,ConvertedComp
5,Canada,Java;R;SQL,366420.0
8,New Zealand,Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;P...,95179.0
12,United States,Bash/Shell/PowerShell;HTML/CSS;JavaScript;PHP;...,90000.0
15,United Kingdom,Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;T...,455352.0
21,United States,Bash/Shell/PowerShell;C++;HTML/CSS;JavaScript;...,103000.0
...,...,...,...
8464,Sweden,C;C#;Java;JavaScript;Python;SQL,79536.0
8468,United States,Bash/Shell/PowerShell;Python;R;SQL,80000.0
8471,United Kingdom,HTML/CSS;Java;JavaScript;Kotlin;Python;Scala;T...,91593.0
8487,France,C#;HTML/CSS;Java;JavaScript;PHP;SQL,378096.0
8489,United States,Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;Java...,105000.0

In [25]:
countries = 'United States', 'Canada'

In [26]:
filt2 = df_public['Country'].isin(countries)

In [31]:
df_public.loc[filt2,['Country','LanguageWorkedWith']]

            Country                                 LanguageWorkedWith
3     United States                                C;C++;C#;Python;SQL
5            Canada                                         Java;R;SQL
11           Canada   Bash/Shell/PowerShell;HTML/CSS;Java;Python;R;SQL
12    United States  Bash/Shell/PowerShell;HTML/CSS;JavaScript;PHP;...
20           Canada  Assembly;Bash/Shell/PowerShell;C;C++;Go;Java;J...
...             ...                                                ...
8466  United States  Bash/Shell/PowerShell;HTML/CSS;JavaScript;PHP;SQL
8468  United States                 Bash/Shell/PowerShell;Python;R;SQL
8477  United States       Bash/Shell/PowerShell;C;Go;JavaScript;Python
8489  United States  Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;Java...
8490  United States                     Bash/Shell/PowerShell;Python;R

[2288 rows x 2 columns]

In [33]:
filt3 = df_public['LanguageWorkedWith'].str.contains('Python', na=False)

In [36]:
df_public.loc[filt3, 'LanguageWorkedWith']

0                         HTML/CSS;Java;JavaScript;Python
1                                     C++;HTML/CSS;Python
3                                     C;C++;C#;Python;SQL
4             C++;HTML/CSS;Java;JavaScript;Python;SQL;VBA
7       Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;Java...
                              ...
8475    Bash/Shell/PowerShell;C;Go;Java;JavaScript;Pyt...
8477         Bash/Shell/PowerShell;C;Go;JavaScript;Python
8479                                           Python;SQL
8489    Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;Java...
8490                       Bash/Shell/PowerShell;Python;R
Name: LanguageWorkedWith, Length: 3558, dtype: object

In [40]:
language = "Python", 'HTML/CSS', 'Java', 'Go'
filt4 = df_public['LanguageWorkedWith'].isin(language)
df_public.loc[filt4, 'LanguageWorkedWith']

2       HTML/CSS
30        Python
44        Python
130         Java
205         Java
          ...
8327        Java
8340        Java
8341      Python
8424      Python
8457        Java
Name: LanguageWorkedWith, Length: 171, dtype: object